var yoyojson={
	"A": {
    "a1":{
     "question":"基本資料",
     "question1":"性別",
      "questionchoice":{
       "A":"男",
       "B":"女",
       },
     },
     "a2":{
     "question1":"年齡",
     "questionchoice":{
         "A":"10-19",
         "B":"20-29",
         "C":"30-39",
         "D":"40-49",
         "E":"50-59"
     }
    }, 
    "a3":{
      "question1":"平均來經日數",
      "questionchoice":{
        "A":"1",
         "B":"2",
         "C":"3",
         "D":"4",
         "E":"5",
         "F":"6",
         "G":"7",
         "H":"8",
         "I":"9",
         "J":"10",
         "K":"11",
         "L":"12",
         "M":"13",
         "N":"14"
      }
    },
    "a4":{
      "question1":"來經時， 你所用的是…",
      "questionchoice":{
        "A":"衛生巾",
        "B":"衛生綿條"
      }
    }
	},

  "B":{
          "q0":"來經情況(包括流量,衛生巾數目,血塊/血崩出現) 跟前一日一樣?",
          "q0c":{
            "A":"是",
            "B":"否",
          },
          "q1":"你全日總共用了多少塊衛生巾？",
          "q2":"承上題, 每塊衛生巾上的經血,有多少塊屬少/中/多流量?",
          "q2Img":{
            "img0":"images/img1.png",
            "img1":"images/img2.png",
            "img2":"images/img3.png"
          },
          "q3":"血塊出現的次數?",
          "q3Img":{
            "img1":"images/img4.jpg",
            "img2":"images/img5.jpeg"
          },
          "q4":"血崩出現的次數?",

          "q5":"請問你曾否到婦科醫生求診或做檢查？",
          "q5Choice":{
            "A":"曾",
            "B":"否"
          },
          "q6":"請問你的血紅素測試結果是…",
          "q6Choice":{
            "A":"沒有測試過",
            "B":"沒有測試過, 但被診斷經血過多或貧血",
            "C":"≤ 4 g/dl",
            "D":"5 - 7 g/dl",
            "E":"8 - 10 g/dl",
            "F":"11 - 14 g/dl",
            "G":"≥ 15 g/dl ",
            "H":"忘記了測試結果, 但被診斷為經血過多或貧血",
            "I":"忘記了測試結果, 但沒有被診斷出任何問題"
          },
          "q7":"請問你現在或曾經因為經血過多或貧血服用以下藥物治療?",
          "q7Choice":{
            "A":"鐵丸/止血丸",
            "B":"避孕藥",
            "C":"藥性子宮環",
            "D":"避孕針",
            "E":"停經針",
            "F":"黃體素",
            "G":"非類固醇消炎藥, 如布洛芬(Ibuprofen) ",
            "H":"凝血劑",
            "I":"沒有服用任何藥物治療"
          }       
        
         
  },
  "C":{
    "q1":"你用了多少塊衛生棉條",
    "q2":"請選擇當天的流量於衛生棉條出現的次數",
    "q2Img":{
      "img0":"images/img4.png",
      "img1":"images/img5.png",
      "img2":"images/img6.png"
    }
  },
  
  "day":{
    "1":"第一日",
    "2":"第二日",
    "3":"第三日",
    "4":"第四日",
    "5":"第五日",
    "6":"第六日",
    "7":"第七日",
    "8":"第八日",
    "9":"第九日",
    "10":"第十日",
    "11":"第十一日",
    "12":"第十二日",
    "13":"第十三日",
    "14":"第十四日",
  },
"game1":{
  "q1topic":"月經期間/來經前後出現的症狀",
  "q1":"曾因受經痛困擾以致無法工作/上學/出席社交活動，或影響日常生活",
  "q1choice":{
    "A":"是",
    "B":"否"
  },
  "q1a":"曾於月經期間出現腹脹、腹痛、壓痛(按壓腹部時感到疼痛)",
  "q1achoice":{
    "A":"是",
    "B":"否"
  },
  "q1b":"曾於月經期間出現腸胃不適情況，例如： 噁心或嘔吐, 腹部絞痛及出現肚瀉/便秘情況",
  "q1bchoice":{
    "A":"是",
    "B":"否"
  },
  "q2topic":"其他症狀",
  "q2":"經常出現全身無力、疲憊等狀況",
  "q2choice":{
    "A":"是",
    "B":"否"
  },
  "q2a":"曾於進行性行為時感到疼痛",
  "q2achoice":{
    "A":"是",
    "B":"否"
  },
  "q2b":"曾有過敏情況，並於月經前後及期間情況轉壞",
  "q2bchoice":{
    "A":"是",
    "B":"否"
  },
  "q3topic":"個人/家族病史",
  "q3":"家族中曾有人患有子宮內膜異位症",
  "q3choice":{
    "A":"是",
    "B":"否"
  },
  "q3a":"曾患朱古力瘤",
  "q3achoice":{
    "A":"是",
    "B":"否"
  },
  "q3b":"曾出現流產、不育或宮外孕",
  "q3bchoice":{
    "A":"是",
    "B":"否"
  },
  "q3c":"曾患上免疫系統疾病或以下疾病:<br/>甲狀腺疾病 /  類風濕關節炎 / 紅斑狼瘡 / 纖維肌痛 / 多發性硬化症 / 慢性偏頭痛",
  "q3cchoice":{
    "A":"是",
    "B":"否"
  },
  "q3d":"曾進行盆腔手術例如腹腔鏡檢查，而懷疑患上子宮內膜異位症，但未曾確診",
  "q3dchoice":{
    "A":"是",
    "B":"否"
  },
  "q4topic":"你知道有關子宮內膜異位症的情況嗎？",
  "q4":"性別",
  "q4choice":{
    "A":"男",
    "B":"女"
  },
  "q4a":"年齡",
  "q4achoice":{
    "A":"20-29",
    "B":"30-39",
    "C":"40-49",
    "D":"50-59"
  },
  "q4b":"曾否聽過子宮內膜異位症",
  "q4bchoice":{
    "A":"是",
    "B":"否"
  },
  "q4c":"認為子宮內膜異位症有機會復發",
  "q4cchoice":{
    "A":"是",
    "B":"否"
  },
  "q4d":"知道子宮內膜異位症可導致不育",
  "q4dchoice":{
    "A":"是",
    "B":"否"
  } 
},

"report":{
  "topic":"經血過多小測試報告",
  "q1":"你經血流量的評估分數是….",
  "q2":"你的血紅素測試結果是…",
  "q2choice":{
    "A":"≤ 4 g/dl",
    "B":"5 - 7 g/dl",
    "C":"8 - 10 g/dl",
    "D":"11 - 14 g/dl",
    "E":"≥ 15 g/dl"
  },
  "q3":"你因為經血過多或貧血而正接受的治療是…(可選多於1項)",
  "q3choice":{
    "A":"鐵丸/止血丸",
    "B":"避孕藥",
    "C":"藥性子宮環",
    "D":"避孕針",
    "E":"停經針",
    "F":"黃體素",
    "G":"非類固醇消炎藥, 如布洛芬(Ibuprofen) ",
    "H":"凝血劑",
    "I":"沒有服用任何藥物治療"
  }  
 

}
}
	 
 